app/views/porcaos/_form.html.erb

    <%= form.label :item_id, "Ingrediente:", style: "display: block" %>
    <%= form.collection_select :item_id, Item.ativos.order(:nome), :id, :nome,
        { prompt: "Selecione um ingrediente..." },
        { class: "form-control", data: { "porcao_form_target": "itemSelect", action: "change->porcao_form#updatePreco" } } %>
---
SELECT "items".* FROM "items" WHERE "items"."ativo" = TRUE ORDER BY "items"."nome" ASC