app/views/porcaos/index.html.erb

  <div class="porcaos-grid">
    <% @porcaos.includes(:item).each do |porcao| %>
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 6)