app/views/lanches/_form.html.erb

    <div class="porcoes-selection" style="max-height: 400px; overflow-y: auto; border: 1px solid #ddd; padding: 15px; border-radius: 5px;">
      <% Porcao.includes(:item).order(:nome).each do |porcao| %>
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 6, 3, 2, 5)
SELECT "porcaos".* FROM "porcaos" ORDER BY "porcaos"."nome" ASC

              <label for="porcao_quantidade_<%= porcao.id %>" style="margin: 0; font-weight: bold;">Qtd:</label>
              <%= number_field_tag "lanch[porcoes_com_quantidade][#{porcao.id}]",
                  (@lanch.lanche_porcaos.find_by(porcao: porcao)&.quantidade || 0),
                  min: 0, max: 10,
                  class: "form-control quantidade-input",
                  style: "width: 70px; text-align: center;",
                  id: "porcao_quantidade_#{porcao.id}",
                  data: {
---
SELECT "lanche_porcaos".* FROM "lanche_porcaos" WHERE "lanche_porcaos"."lanch_id" = 8 AND "lanche_porcaos"."porcao_id" = 5 LIMIT 1