app/views/lanches/_form.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 6, 3, 2)
SELECT "porcaos".* FROM "porcaos"
SELECT 1 AS one FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 1 AND "porcaos"."id" = 1 LIMIT 1
---
    <div class="porcoes-selection" style="max-height: 300px; overflow-y: auto; border: 1px solid #ddd; padding: 10px; border-radius: 5px;">
      <% Porcao.includes(:item).each do |porcao| %>
        <div class="porcao-checkbox" style="margin-bottom: 8px;">
          <%= check_box_tag "lanch[porcao_ids][]", porcao.id,
              lanch.porcaos.include?(porcao),
              id: "porcao_#{porcao.id}",
              data: {