app/views/lanches/index.html.erb

  <div class="lanches-grid">
    <% @lanches.includes(:porcaos).each do |lanch| %>
---
SELECT "porcaos".* FROM "porcaos" WHERE "porcaos"."id" IN (2, 3, 4)

        <div class="lanche-info">
          <p><strong>Porções:</strong> <%= lanch.porcaos.count %> item(ns)</p>
---
SELECT COUNT(*) FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 1

              <small>
                <% lanch.porcaos.includes(:item).each do |porcao| %>
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (6, 3, 2)
SELECT "porcaos".* FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 1