app/views/lanches/index.html.erb

SELECT "lanche_porcaos".* FROM "lanche_porcaos" WHERE "lanche_porcaos"."lanch_id" IN (3, 4)
SELECT "lanches".* FROM "lanches"
SELECT SUM("lanche_porcaos"."quantidade") FROM "lanche_porcaos" WHERE "lanche_porcaos"."lanch_id" = 3
SELECT COUNT(*) FROM "lanche_porcaos" WHERE "lanche_porcaos"."lanch_id" = 3
---
          <p><strong>Porções:</strong>
            <%= lanch.lanche_porcaos.sum(:quantidade) %> unidade(s)
            (<%= lanch.lanche_porcaos.count %> tipo(s))

SELECT 1 AS one FROM "lanches" LIMIT 1
---

          <% if lanch.lanche_porcaos.any? %>

SELECT "lanche_porcaos".* FROM "lanche_porcaos" WHERE "lanche_porcaos"."lanch_id" = 3
---
              <small>
                <% lanch.lanche_porcaos.each do |lanche_porcao| %>