app/views/lanches/show.html.erb

    <h3>Porções Utilizadas:</h3>
    <% if @lanch.porcaos.any? %>
      <div class="porcoes-detalhes">
        <% @lanch.lanche_porcaos.includes(:porcao, porcao: :item).each do |lanche_porcao| %>
---
SELECT "porcaos".* FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 2
SELECT 1 AS one FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 2 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" IN (6, 3, 2, 5)
SELECT "lanche_porcaos".* FROM "lanche_porcaos" WHERE "lanche_porcaos"."lanch_id" = 8