app/views/lanches/show.html.erb

SELECT 1 AS one FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 1 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" IN (6, 3, 2)
SELECT "porcaos".* FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 1
---
    <h3>Porções Utilizadas:</h3>
    <% if @lanch.porcaos.any? %>
      <div class="porcoes-detalhes">
        <% @lanch.porcaos.includes(:item).each do |porcao| %>