app/views/compras/index.html.erb

  <!-- Resumo dos Preços Médios -->
  <% items_com_compras = @compras.includes(:item).map(&:item).uniq %>
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 2)

            <span style="color: #28a745; font-size: 1.1em;">R$ <%= number_with_precision(item.preco, precision: 2) %>/kg</span><br>
            <small style="color: #6c757d;">(<%= item.compras.count %> compras)</small>
---
SELECT "compras".* FROM "compras"
SELECT COUNT(*) FROM "compras" WHERE "compras"."item_id" = 1

  <div class="compras-grid">
    <% @compras.includes(:item).each do |compra| %>
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 2)