app/controllers/compras_controller.rb

SELECT "compras".* FROM "compras"
---
  def index
    @compras = Compra.all

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---
  def item_data
    item = Item.find(params[:id])

INSERT INTO "compras" ("item_id", "nome", "preco", "peso", "data_compra", "created_at", "updated_at") VALUES (1, 'batata', 40.0, 1.0, '2025-06-02', '2025-06-02 20:17:59.277196', '2025-06-02 20:17:59.277196') RETURNING "id"
---
  def create
    @compra = Compra.new(compra_params)

    respond_to do |format|
      if @compra.save

UPDATE "compras" SET "preco" = 4.0, "updated_at" = '2025-06-02 20:32:52.207935' WHERE "compras"."id" = 1
---
  def update
    respond_to do |format|
      if @compra.update(compra_params)

SELECT "compras".* FROM "compras" WHERE "compras"."id" = 1 LIMIT 1
---
    def set_compra
      @compra = Compra.find(params.expect(:id))