app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("nome", "preco", "peso", "descricao", "categoria", "disponivel", "ativo", "created_at", "updated_at") VALUES ('batata', 2000.0, 2.0, '', 'batata', TRUE, TRUE, '2025-06-02 20:00:37.387894', '2025-06-02 20:00:37.387894') RETURNING "id"

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "peso" = 1.0, "updated_at" = '2025-06-02 20:19:02.633681' WHERE "items"."id" = 1

    def set_item
      @item = Item.find(params.expect(:id))
---
SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1