app/controllers/lanches_controller.rb

  def index
    @lanches = Lanch.includes(lanche_porcaos: { porcao: :item }).with_attached_fotos
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (6, 3, 2)
SELECT "lanches".* FROM "lanches"

  def create
    @lanch = Lanch.new(lanch_params)

    respond_to do |format|
      if @lanch.save
---
INSERT INTO "lanches" ("nome", "ingredientes", "custo", "preco_sugerido", "created_at", "updated_at") VALUES ('hamburge', '', 0.0, 0.0, '2025-06-02 21:08:20.555073', '2025-06-02 21:08:20.555073') RETURNING "id"

  def update
    respond_to do |format|
      # Processar fotos separadamente para adicionar ao invés de substituir
      if params[:lanch][:fotos].present?
        adicionar_fotos_ao_lanche
        params[:lanch].delete(:fotos)  # Remove do params para não sobrescrever
      end

      # Processar porções com quantidades
      if params[:lanch][:porcoes_com_quantidade].present?
        processar_porcoes_com_quantidade
        params[:lanch].delete(:porcoes_com_quantidade)
      end

      if @lanch.update(lanch_params)
---
DELETE FROM "lanches" WHERE "lanches"."id" = 1
UPDATE "lanches" SET "custo" = 16.28, "preco_sugerido" = 32.56, "updated_at" = '2025-06-16 15:58:38.342298' WHERE "lanches"."id" = 8

  def destroy
    @lanch.destroy!
---
DELETE FROM "lanches" WHERE "lanches"."id" = 2

    def set_lanch
      @lanch = Lanch.find(params.expect(:id))
---
SELECT "lanches".* FROM "lanches" WHERE "lanches"."id" = 8 LIMIT 1

    def processar_porcoes_com_quantidade
      return unless params[:lanch][:porcoes_com_quantidade].present?

      # Remove todas as porções atuais
      @lanch.lanche_porcaos.destroy_all

      # Adiciona as novas porções com quantidades
      params[:lanch][:porcoes_com_quantidade].each do |porcao_id, quantidade|
        quantidade_int = quantidade.to_i
        if quantidade_int > 0
          @lanch.lanche_porcaos.create!(
            porcao_id: porcao_id.to_i,
            quantidade: quantidade_int
          )
---
DELETE FROM "lanche_porcaos" WHERE "lanche_porcaos"."id" = 38
INSERT INTO "lanche_porcaos" ("lanch_id", "porcao_id", "created_at", "updated_at", "quantidade") VALUES (8, 5, '2025-06-16 15:58:38.238123', '2025-06-16 15:58:38.238123', 1) RETURNING "id"