app/controllers/lanches_controller.rb

  def update
    respond_to do |format|
      if @lanch.update(lanch_params)
---
UPDATE "lanches" SET "custo" = 8.2, "preco_sugerido" = 16.4, "updated_at" = '2025-06-02 21:08:34.454843' WHERE "lanches"."id" = 1

    def set_lanch
      @lanch = Lanch.find(params.expect(:id))
---
SELECT "lanches".* FROM "lanches" WHERE "lanches"."id" = 1 LIMIT 1