app/controllers/lanches_controller.rb

UPDATE "lanches" SET "custo" = 5.2905, "preco_sugerido" = 10.581, "updated_at" = '2025-06-16 15:17:06.186509' WHERE "lanches"."id" = 3
---
  def move_up
    lanch = Lanch.find(params[:id])
    anterior = Lanch.where("posicao < ?", lanch.posicao).order(posicao: :desc).first
    if anterior
      lanch.posicao, anterior.posicao = anterior.posicao, lanch.posicao
      lanch.save!