app/controllers/porcaos_controller.rb

SELECT "porcaos".* FROM "porcaos"
---
  def index
    @porcaos = Porcao.all

INSERT INTO "porcaos" ("item_id", "peso_utilizado", "custo", "created_at", "updated_at", "nome") VALUES (6, 1.0, 3.0, '2025-06-16 15:46:20.246846', '2025-06-16 15:46:20.246846', 'pao de hamburgue') RETURNING "id"
---
  def create
    @porcao = Porcao.new(porcao_params)

    respond_to do |format|
      if @porcao.save

UPDATE "porcaos" SET "peso_utilizado" = 0.1, "custo" = 4.0, "updated_at" = '2025-06-02 21:06:34.291816' WHERE "porcaos"."id" = 3
---
  def update
    respond_to do |format|
      if @porcao.update(porcao_params)

DELETE FROM "porcaos" WHERE "porcaos"."id" = 2
---
  def destroy
    @porcao.destroy!

SELECT "porcaos".* FROM "porcaos" WHERE "porcaos"."id" = 1 LIMIT 1
---
    def set_porcao
      @porcao = Porcao.find(params.expect(:id))