app/models/compra.rb

SELECT 1 AS one FROM "compras" WHERE "compras"."item_id" = 1 LIMIT 1
SELECT AVG("compras"."preco") FROM "compras" WHERE "compras"."item_id" = 1
UPDATE "items" SET "preco" = 40.0 WHERE "items"."id" = 1
---
  def atualizar_item_com_media
    return unless item

    compras_do_item = item.compras

    if compras_do_item.any?
      # Calcula apenas a média dos preços
      preco_medio = compras_do_item.average(:preco)

      # Atualiza apenas o preço do item, peso fica fixo em 1kg
      item.update_column(:preco, preco_medio.round(2))

SELECT "porcaos".* FROM "porcaos" WHERE "porcaos"."item_id" = 2
---
  def atualizar_custos_das_porcoes
    return unless item

    # Recalcula o custo de todas as porções deste item
    item.porcaos.each do |porcao|