app/models/lanch.rb

  def total_custo
    lanche_porcaos.includes(:porcao).sum { |lp| (lp.porcao.custo || 0) * lp.quantidade }
---
SELECT "porcaos".* FROM "porcaos" WHERE "porcaos"."id" IN (5, 3, 12, 11, 16, 4, 15)
SELECT SUM("porcaos"."custo") FROM "porcaos" INNER JOIN "lanche_porcaos" ON "porcaos"."id" = "lanche_porcaos"."porcao_id" WHERE "lanche_porcaos"."lanch_id" = 2